//Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.

Console.WriteLine("Enter number");
int NumberA = Convert.ToInt32(Console.ReadLine());
string stringNumber = Convert.ToString(NumberA);

